
export const QA_order = [
  {
    title: "我該如何訂購客製化餐點？",
    content: "前往自由搭配頁，依序挑選主食、蛋白質、配料與醬汁，系統會即時顯示熱量與營養素。",
    id: "howToOder1",
  },
  {
    title: "是否有最低訂購量或金額限制？",
    content: "無，歡迎盡情選購！",
    id: "howToOder2",
  },
  {
    title: "可以同時訂購固定套餐與客製化餐嗎？",
    content: "可以的，您可同時訂購固定套餐與客製化餐點，滿足不同需求。",
    id: "howToOder3",
  },
  {
    title: "如何知道我的餐點已經成功下訂？",
    content: "您可登入會員中心，前往「訂單紀錄」查看訂單狀態，若顯示訂單成立即代表已成功下訂。",
    id: "howToOder4",
  },
  {
    title: "訂單可以修改或取消嗎？什麼時候可以取消？",
    content: "訂單成立後恕無法修改，但可於「尚未付款」前自行取消訂單；若已完成付款，則無法取消。",
    id: "howToOder5",
  },
];

export const QA_take = [
  {
    title: "GreenGo 提供外送服務嗎？",
    content: "目前尚未提供外送服務，僅可選擇外帶服務。",
    id: "howTotake1",
  },
  {
    title: "外帶餐點可以提前多久預訂？",
    content: "外帶餐點需依訂購數量決定預訂時間；一般訂單可當天預訂，大量餐點請於 3 天前完成下訂，以利備料與安排製作。",
    id: "howTotake2",
  },
  {
    title: "取餐時需要出示什麼資訊？",
    content: "取餐時請提供會員中心「訂單紀錄」中的取餐號碼，以利我們快速為您核對餐點。",
    id: "howTotake3",
  },

];

export const QA_payment = [
  {
    title: "支付方式有哪些？",
    content: "目前提供信用卡／金融卡（Visa、Master、JCB）、電子支付（LINE Pay、街口支付、Apple Pay）及臨櫃現金付款。",
    id: "howToPay1",
  },
  {
    title: "線上付款安全嗎？需要輸入哪些資訊？",
    content: "我們使用的線上付款平台皆採用國際安全加密技術（HTTPS），保護您的交易資料不被竊取。只要在官方付款頁面操作，一般是非常安全的。建議您避免在陌生網站或可疑連結輸入付款資訊。",
    id: "howToPay2",
  },
  {
    title: "付款後是否可以索取電子發票或收據？",
    content: "可以的！員工會在您取餐時，隨餐一併提供電子發票或收據，麻煩協助於取餐時確認發票資訊是否正確。",
    id: "howToPay3",
  },
];

export const QA_member = [
  {
    title: "如何註冊／登入會員？",
    content: "您可以點擊網站右上角的「註冊／登入」按鈕，依照提示輸入手機號碼或電子信箱，完成驗證後即可成為會員並登入。",
    id: "howToMember1",
  },
  {
    title: "忘記密碼怎麼辦？",
    content: "如果忘記密碼，請點擊網站右上角的「登入」→「忘記密碼」，輸入您註冊的手機號碼或電子信箱，我們會寄送驗證連結或一次性密碼，讓您重新設定密碼並順利登入會員。",
    id: "howToMember2",
  },
  {
    title: "一定要加入會員才能點餐嗎？",
    content: "是的，我們的線上點餐服務需要會員登入才能使用。建議您先完成註冊，還能享受會員優惠。",
    id: "howToMember3",
  },
  {
    title: "可以修改個人資料嗎？",
    content: "可以的！登入會員後，進入「會員中心」或「個人資料」頁面，即可修改您的姓名、電話、電子信箱等資訊。",
    id: "howToMember4",
  },
  {
    title: "會員是否可以查看歷史訂單與訂餐紀錄？",
    content: "可以的！會員登入後，進入「訂單紀錄」頁面，即可查看過去的訂餐紀錄，包含訂單內容、付款狀態與取餐日期。",
    id: "howToMember5",
  },
  {
    title: "是否有累積點數或優惠券功能？",
    content: "我們目前沒有點數累積功能，但會員可使用系統發放的優惠券享受折扣，讓用餐更划算。",
    id: "howToMember6",
  },
];